---
type: IExternalApplication
namespace: Autodesk.Revit.UI
version: 2024
members: 2
tags: [revit-api, class]
---

# IExternalApplication

`Autodesk.Revit.UI.IExternalApplication` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | OnShutdown | — | `Result OnShutdown ( UIControlledApplication application )` |
| Method | OnStartup | — | `Result OnStartup ( UIControlledApplication application )` |